tap "2ykwang/2ykwang"
tap "azure/bicep"
tap "hashicorp/tap"
tap "jandedobbeleer/oh-my-posh"
brew "azure-cli"
brew "btop"
brew "chezmoi"
brew "dockutil"
brew "gh"
brew "git"
brew "imagemagick"
brew "mas"
brew "rbenv"
brew "ruby"
brew "wget"
brew "2ykwang/2ykwang/mac-cleanup-go"
brew "azure/bicep/bicep"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
cask "1password"
cask "1password-cli"
cask "appcleaner"
cask "brave-browser"
cask "font-hack-nerd-font"
cask "git-credential-manager"
cask "github"
cask "imageoptim"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "pearcleaner"
cask "powershell"
cask "signal"
cask "slack"
cask "the-unarchiver"
cask "visual-studio-code"
cask "whatsapp"
mas "1Password for Safari", id: 1569813296
mas "Windows App", id: 1295203466
vscode "adpyke.codesnap"
vscode "davidbwaters.macos-modern-theme"
vscode "emilast.logfilehighlighter"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "hashicorp.terraform"
vscode "mechatroner.rainbow-csv"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.powershell"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "redhat.vscode-yaml"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
